3ash.nord-flat
amazonwebservices.codewhisperer-for-command-line-companion
anthropic.claude-code
docker.docker
enkia.tokyo-night
github.copilot
github.copilot-chat
github.vscode-github-actions
google.gemini-cli-vscode-ide-companion
janisdd.vscode-edit-csv
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
redhat.vscode-yaml
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
yzhang.markdown-all-in-one
