tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "broot"
brew "clisp"
brew "direnv"
brew "fastfetch"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "gotop"
brew "just"
brew "lsd"
brew "neovim"
brew "nodebrew"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "postgresql@16", restart_service: :changed
brew "pyenv"
brew "sl"
brew "starship"
brew "texlive"
brew "tmux"
brew "tree"
brew "wget"
brew "xsv"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "clojure/tools/clojure"
cask "font-hack-nerd-font"
cask "font-ipaexfont"
cask "google-cloud-sdk"
cask "mactex-no-gui"
