tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "broot"
brew "clisp"
brew "direnv"
brew "fastfetch"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "gotop"
brew "just"
brew "lsd"
brew "neovim"
brew "nodebrew"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "postgresql@16", restart_service: :changed
brew "pyenv"
brew "sl"
brew "starship"
brew "texlive"
brew "tmux"
brew "tree"
brew "wget"
brew "xsv"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "clojure/tools/clojure"
cask "font-hack-nerd-font"
cask "font-ipaexfont"
cask "google-cloud-sdk"
cask "mactex-no-gui"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "corschenzi.mermaid-graphical-editor"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jprestidge.theme-material-theme"
vscode "julialang.language-julia"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzhang.markdown-all-in-one"
