alexcvzz.vscode-sqlite
amazonwebservices.codewhisperer-for-command-line-companion
corschenzi.mermaid-graphical-editor
ecmel.vscode-html-css
github.copilot
github.copilot-chat
github.vscode-pull-request-github
hediet.vscode-drawio
janisdd.vscode-edit-csv
jprestidge.theme-material-theme
julialang.language-julia
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
yzhang.markdown-all-in-one
